export const teamCap = {
    options: {
        'Очень низкая': 1.24,
        'Низкая': 1.1,
        'Номинальная': 1,
        'Высокая': 0.91,
        'Очень высокая': 0.82,
    },
    currentValue: 'Номинальная',
};

export const PERS = {
    options: {
        'Очень низкий': 1.62,
            'Низкий': 1.26,
            'Номинальный': 1,
            'Высокий': 0.83,
            'Очень высокий': 0.63,
            'Сверхвысокий': 0.5
    },
    currentValue: 'Номинальный',
};

export const RCPX = {
    options: {
        'Очень низкий': 0.60,
        'Низкий': 0.83,
        'Номинальный': 1,
        'Высокий': 1.33,
        'Очень высокий': 1.91,
        'Сверхвысокий': 2.72
    },
    currentValue: 'Номинальный',
};

export const RUSE = {
    options: {
        'Низкий': 0.95,
        'Номинальный': 1,
        'Высокий': 1.07,
        'Очень высокий': 1.15,
        'Сверхвысокий': 1.24
    },
    currentValue: 'Номинальный',
};

export const PDIF = {
    options: {
        'Низкий': 0.87,
        'Номинальный': 1,
        'Высокий': 1.29,
        'Очень высокий': 1.81,
        'Сверхвысокий': 2.61
    },
    currentValue: 'Номинальный',
};

export const PREX = {
    options: {
        'Очень низкий': 1.33,
        'Низкий': 1.22,
        'Номинальный': 1,
        'Высокий': 0.87,
        'Очень высокий': 0.74,
        'Сверхвысокий': 0.62
    },
    currentValue: 'Номинальный',
};

export const FCIL = {
    options: {
        'Очень низкий': 1.3,
        'Низкий': 1.1,
        'Номинальный': 1,
        'Высокий': 0.87,
        'Очень высокий': 0.73,
        'Сверхвысокий': 0.62
    },
    currentValue: 'Номинальный',
};

export const SCED = {
    options: {
        'Очень низкий': 1.43,
        'Низкий': 1.14,
        'Номинальный': 1,
        'Высокий': 1,
        'Очень высокий': 1,
    },
    currentValue: 'Номинальный',
};

export const PREC = {
    options: {
        'Полное отсутствие прецедентов, полностью непредсказуемый проект': 6.2,
        'Почти полное отсутствие прецедентов, в значительной мере непредсказуемый проект': 4.96,
        'Наличие некоторого количества прецедентов': 3.72,
        'Общее знакомство с проектом': 2.48,
        'Значительное знакомство с проектом': 1.24,
        'Полное знакомство с проектом': 0,
    },
    currentValue: 'Полное знакомство с проектом',
};

export const FLEX = {
    options: {
        'Точный, строгий процесс разработки': 5.07,
        'Случайные послабления в процессе': 4.05,
        'Некоторые послабления в процессе': 3.04,
        'Большей частью согласованный процесс': 2.03,
        'Некоторое согласование процесса': 1.01,
        'Заказчик определил только общие цели': 0,
    },
    currentValue: 'Заказчик определил только общие цели',
};

export const RESL = {
    options: {
        'Малое (20 %)': 7,
        'Некоторое (40 %)': 5.65,
        'Частое (60 %)': 4.24,
        'В целом (75 %)': 2.83,
        'Почти полное (90 %)': 1.41,
        'Полное (100%)': 0,
    },
    currentValue: 'Полное (100%)',
};

export const TEAM = {
    options: {
        'Сильно затрудненное взаимодействие': 5.48,
        'Несколько затрудненное взаимодействие': 4.38,
        'Некоторая согласованность': 3.29,
        'Повышенная согласованность': 2.19,
        'Высокая согласованность': 1.1,
        'Взаимодействие как в едином целом': 0,
    },
    currentValue: 'Взаимодействие как в едином целом',
};

export const PMAT = {
    options: {
        'Уровень 1 СММ ': 7,
        'Уровень 1+ СММ': 6.24,
        'Уровень 2 СММ': 4.68,
        'Уровень 3 СММ': 1.12,
        'Уровень 7 СММ': 1.56,
        'Уровень 5 СММ': 0,
    },
    currentValue: 'Уровень 5 СММ',
};
